token = '554435450:AAFbSPEFRQ3mc7C1cdTJXkVXPsTocKfWyuI'
bot_send_message_begin_1 = 'Хорошо, тогда ответь на простой вопрос.\n' \
                           'Linux или Windows?'
bot_send_message_begin_2 = 'Пфффф...ну, как хочешь.\n Приступим к делу.'
bot_send_message_begin_3 = 'Броо, дай свою царскую пятюну. Вот твой обещанный флаг.\n' \
                           'escctf{men_this_looooolz}\n' \
                           'АХАХАХ, ладно, я пошутил, чтобы получить флаг тебе придется попотеть.\nПогнали!'
bot_send_message_begin_4 = 'Парень, ты серьезно?\n' \
                           'Это же просто. Ладно, спишем на мисклик.'

bot_send_message_1_1 = 'Начнем с простого. Какая команда в Linux выведет директорию, в которой сейчас находится' \
                       ' пользователь?'
bot_send_message_1_2 = 'Неплохо, посмотрим как ты справишся со следующим вопросом.'
bot_send_message_1_3 = 'Это немного не то, чего я ожидал.\n' \
                       'Прости, но тебе придется начать с начала.\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_2_1 = 'Как называется приложение, которое позволяет запускать программы, написанные для' \
                       ' Windows, в Linux?'
bot_send_message_2_2 = 'Хорошо, но самое сложное еще впереди.'
bot_send_message_2_3 = 'Это всего лишь второй вопрос и уже ошибка ...не ожидал ...не ожидал.\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_3_1 = 'Какая программа в Linux изменяет разрешение прав доступа к файлу?'
bot_send_message_3_2 = 'Кхе, кхе, эти апплодисменты тебе (хлоп-хлоп-хлоп-хлоп-хлоп).'
bot_send_message_3_3 = 'Чувак, тебе бы матчасть подтянуть.\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_4_1 = 'Вот щас будет СЛОЖНО. Ты готов?\n' \
                       'Какой результат выполнения команды echo {a{b,c},b{1..3},e{d..g},c}?'
bot_send_message_4_2 = 'Нот бэд, нот бэд.'
bot_send_message_4_3 = 'Ладно, это действительно сложно, поэтому не вини себя, у каждого есть право на ошибку\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_5_1 = 'Чем в Bash заканачивается конструкция "if... then..."'
bot_send_message_5_2 = 'Да ты просто Джими Нейтрон!'
bot_send_message_5_3 = 'Свое право на ошибку ты исчерпал в четвертом вопросе, так что давай все с начала.\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_6_1 = 'Программа для вывода сообщений ядра в вывод консоли Linux?'
bot_send_message_6_2 = 'Уверен ты этого не знал, как и я до недавнего времени. Cогласись очень полезная информация?'
bot_send_message_6_3 = 'Если честно, я тоже не знаю ответ, как узнаешь, возвращайся\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_7_1 = 'Лучший текстовый редактор в мире для Linux?'
bot_send_message_7_2 = 'Как ни странно, он однавременно и худший.'
bot_send_message_7_3 = 'Да не ври, все ты знаешь.\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_8_1 = 'Как называется популярный загрузчик для Unix-систем?'
bot_send_message_8_2 = 'Что-то слишком легко для восьмого вопроса, в следующей версии придумаю что-нибудь посложнее.'
bot_send_message_8_3 = 'Дам подсказку(Используй Google-FU)\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_9_1 = 'Самая короткая команда для перехода в домашнюю директорию Linux?'
bot_send_message_9_2 = 'Финишняя прямая.\n А стой, еще нет, прости, ошибочка вышла.'
bot_send_message_9_3 = 'Дааааа.... чем выше поднялся, тем больнее падать, хорошо что я не живой(((\n' \
                       'Для продолжения отправьте "+"'

bot_send_message_10_1 = 'Как называется одна из надстроек над netfilters?'
bot_send_message_10_2 = 'Этот вопрос скорее всего никто не решит, но если ты это читаешь, поздравляю.'
bot_send_message_10_3 = 'Знаешь, а ведь впереди еще 20 вопросов, а с таким количеством ошибок CTF просто ' \
                        'закончится и все уйдут без тебя.'


bot_send_message_11_1 = 'Ты молодец, еще каких-то 20 вопросов и ты получишь свой флаг.\n' \
                        'Согласен продолжить: "+"  или "-" ?'
bot_send_message_11_2 = 'Да ладно, я пошутил, на держи свой флаг\n' \
                        'escctf{Dud3_1s_CTFch1k}'


bot_question_0 = 'Начнем с простого. Какая команда в Linux выведет директорию, в которой сейчас находится' \
                 ' пользователь?'
bot_question_1 = 'Какая команда в Linux выведет директорию, в которой сейчас находится' \
                 ' пользователь?'
bot_question_2 = 'Как называется приложения, которое позволяет запускать программы, написанные для' \
                 ' Windows, в Линуксе?'
bot_question_3 = 'Какой результат выполнения команды echo  {a{b,c},b{1..3},e{d..g},c}?'
bot_question_4 = 'Какая программа изменяет разрешения прав доступа к файлу?'
bot_question_5 = 'Чем в Bash заканачивается конструкция "if... then..."'
bot_question_6 = 'Программа для вывода сообщений ядра в вывод консоли Linux?'
bot_question_7 = 'Лучший текстовый редактор в мире для Linux?'
bot_question_8 = 'Как называется популярных загрузчик для Unix-систем?'
bot_question_9 = 'Самая короткая команда для перехода в домашнюю директорию Linux?'
bot_question_10 = 'Как называется одна из надстроек над netfilters?'


bot_true_answer_0 = 'linux'
bot_true_answer_1 = 'pwd'
bot_true_answer_2 = 'wine'
bot_true_answer_3 = 'chmod'
bot_true_answer_4 = 'ab ac b1 b2 b3 ed ee ef eg c'
bot_true_answer_5 = 'fi'
bot_true_answer_6 = 'dmesg'
bot_true_answer_7 = 'vim'
bot_true_answer_8 = 'grub'
bot_true_answer_9 = 'cd'
bot_true_answer_10 = 'iptables'

