token = '554435450:AAFbSPEFRQ3mc7C1cdTJXkVXPsTocKfWyuI'

bot_send_message_begin_1 = 'Хорошо, тогда ответь на простой вопрос.\n' \
                           '1 + 1 = ?'
bot_send_message_begin_2 = 'Пфффф, ну как хочешь.\n Тогда приступим к делу.'
bot_send_message_begin_3 = 'Ахахах, а ты весьма неплох, так уж и быть держи.\n' \
                           'escctf{men_this_looooolz}\n' \
                           'АХАХАХ, ладно я пошутил, чтобы получить флаг тебе придется попатеть.\nЛадно погнали.'
bot_send_message_begin_4 = 'Парень, ты серьезно?\n' \
                           'Попробуй еще раз.'

bot_send_message_1_1 = 'Начнем с простого. Какая команда в Linux выведет директорию, в которой сейчас находится' \
                       ' пользователь?'
bot_send_message_1_2 = 'Ух ты, неплохо для такого как ты.'
bot_send_message_1_3 = 'Это немного не то чего я ожидал.\n' \
                       'Прости, но тебе придется начать с начала.\n' \
                       'Для продолжения отправте "+"'

bot_send_message_2_1 = 'Как называется приложения, которое позволяет запускать программы, написанные для' \
                       ' Windows, в Линуксе?'
bot_send_message_2_2 = 'Хорошо, но самое сложное еще впереди.'
bot_send_message_2_3 = 'Да сколько можно ошибаться?!\n' \
                       'Для продолжения отправте "+"'

bot_send_message_3_1 = 'Какой результат выполнения команды echo  {a{b,c},b{1..3},e{d..g},c}?'
bot_send_message_3_2 = 'Нот бэд, нот бэд.'
bot_send_message_3_3 = 'Ты как вообще в школу поступил?\n' \
                       'Для продолжения отправте "+"'

bot_send_message_4_1 = 'Какая программа изменяет разрешения прав доступа к файлу?'
bot_send_message_4_2 = 'Вау, не ожидал от тебя такого.'
bot_send_message_4_3 = 'Что и следовало ожидать от тебя.\n' \
                       'Для продолжения отправте "+"'

bot_send_message_5_1 = 'Как проверить, запущен ли процесс, не используя утилиты top или htop?'
bot_send_message_5_2 = 'Да ты просто Джими Нейтрон.'
bot_send_message_5_3 = 'Как ты вообще до пятого вопроса вообще дошел?\n' \
                       'Для продолжения отправте "+"'

bot_send_message_6_1 = 'Ты мододец, еще каких то 20 вопросов и ты получишь свой флаг.\n' \
                       'Согласен продолжить: "+"  или "-"'
bot_send_message_6_2 = 'Да ладно я пошутил, на держи свой флаг\n' \
                       'escctf{Dud3_1s_CTFch1k}'


bot_question_0 = '1 + 1 = ?'
bot_question_1 = 'Какая команда в Linux выведет директорию, в которой сейчас находится' \
                 ' пользователь?'
bot_question_2 = 'Как называется приложения, которое позволяет запускать программы, написанные для' \
                 ' Windows, в Линуксе?'
bot_question_3 = 'Какой результат выполнения команды echo  {a{b,c},b{1..3},e{d..g},c}?'
bot_question_4 = 'Какая программа изменяет разрешения прав доступа к файлу?'
bot_question_5 = 'Как проверить, запущен ли процесс, не используя утилиты top или htop?'


bot_true_answer_0 = '2'
bot_true_answer_1 = 'pwd'
bot_true_answer_2 = 'wine'
bot_true_answer_3 = 'ab ac b1 b2 b3 ed ee ef eg c'
bot_true_answer_4 = 'chmod'
bot_true_answer_5 = 'ps'
